app/controllers/deals_controller.rb

  def create
    @teste = Deal.new(pet_id: params[:pet_id], value: params[:value], date: params[:date], amount: params[:amount])
    if @teste.save
---
INSERT INTO "deals" ("pet_id", "value", "amount", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["pet_id", 1], ["value", 45.0], ["amount", 50.0], ["date", "2020-12-01"], ["created_at", "2020-12-02 12:25:31.668212"], ["updated_at", "2020-12-02 12:25:31.668212"]]

  def show
    render json: Deal.find(params[:id])
---
SELECT "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def index
    render json: Deal.all()
---
SELECT "deals".* FROM "deals"