app/controllers/deals_controller.rb

SELECT "deals".* FROM "deals" WHERE "deals"."pet_id" = ?  [["pet_id", 13]]
---
  def show
    render json: Deal.where(pet_id: params[:id])