app/controllers/pets_controller.rb

  def create
    Pet.new(name: params[:name]).save
---
INSERT INTO "pets" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Zeus"], ["created_at", "2020-12-01 13:28:27.239931"], ["updated_at", "2020-12-01 13:28:27.239931"]]

  def getDeal
    @pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    render json: Pet.all
---
SELECT "pets".* FROM "pets"

  def delete
    if Pet.destroy(params[:id])
---
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 2]]