app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("date", "value", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date", "2020-12-20"], ["value", 35.0], ["amount", 277.0], ["created_at", "2020-11-20 14:52:06.295077"], ["updated_at", "2020-11-20 14:52:06.295077"]]
---
  def create
    Transaction.new(pet: params[:pet], value: params[:value], amount: params[:amount], date: params[:date]).save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Transaction.find(params[:id])

SELECT "transactions".* FROM "transactions"
---
  def index
    render json: Transaction.all()